no = "🔴 Занят"
yes = "🟢 Свободен"
wait = "🟡 Ожидаем игроков"

cn = '🔴'
cy = '🟢'
cw = '🟡'

explane = '\n\n'+no+"\n"+yes+"\n"+wait

batid = '1404614064'
no_db = 'lock'
yes_db = 'free'
wait_db = 'await'
empty = "Отсутствует"

impostor = "Увы, но ты не имеешь доступа к этой функции("
hello = "Привет!"
begin = "Привет!\nПрежде чем мы начнем, ответь, пожалуйста, на вопрос"
topush = "Можно ли тебе присылать уведомления о том, какие игры освободились, \
 а какие ждут игроков, чтобы начать играть?"
mod = "Добро пожаловать в режим модератора! \
\nЧто ты желаешь сделать?\
\n1. Добавить игру\
\n2. Сесть за стол / Освободить стол\
\n3. Взять игру / Выпустить на свободу (вне стола)\
\n4. Удалить игру из списка\
\n5. Посмотреть список игр\
\n6. Посмотреть столы\
\n7. Отправить сообщение пользователям\
\n8. Выйти из режима модератора"

start = "Меня зовут Table Games Bot. Я буду твоим личным помощником в этот вечер\
\n\nВот что я могу рассказать:\
\n\n1️⃣ Какие столы сейчас заняты\
\n2️⃣ Какие игры у нас есть\
\n3️⃣ Кто такие КТМ, ГИК и GEEKMO\
\n4️⃣ Разрешить / Запретить уведомления"

youcandoit = "\nВы можете ввести название или номер игры в списке"
questionchange = "Игра занята?\n1. Да\n2. Нет"
questiontable = "Стол?\n1. Заняли\n2. Освободили"
nosuchgame = "Данная игра отсуствует в базе данных!"
quesadd = "\nДобавить? \n1. Да\n2. Нет"
choise = "\n1. Да\n2. Нет"
waiting = "\n1. Ждать\n2. Начать играть"
goodchange = "Успешно!"
spisok = "Список игр:"
error = "Ошибка!"

numbers = ['0️⃣','1️⃣','2️⃣','3️⃣','4️⃣','5️⃣','6️⃣','7️⃣','8️⃣','9️⃣','🔟','1️⃣1️⃣','1️⃣2️⃣','1️⃣3️⃣','1️⃣4️⃣','1️⃣5️⃣','1️⃣6️⃣',
           '1️⃣7️⃣','1️⃣8️⃣','1️⃣9️⃣','2️⃣0️⃣','2️⃣1️⃣','2️⃣2️⃣','2️⃣3️⃣','2️⃣4️⃣','2️⃣5️⃣','2️⃣6️⃣','2️⃣7️⃣','2️⃣8️⃣','2️⃣9️⃣','3️⃣0️⃣']

explainmod = "Здравствуй, дорогуша\n\nПеред тобой, как модератором стоит задача отмечать, какие игры заняты, а какие игры свободны.\
 Прежде чем приступить к твоей важной миссии ведущего, т.е. прежде чем приступить к игре, просто открой бот, напиши /mod\
 и выбери, что тебе нужно.\nЯ предполагаю, что в основном тебе понадобятся пункты /2 и /3. Без '/' они не будут работать\
 так что не нужно вводить 1, 2, 3, 4... Специально для этого есть кнопки!\n\nПожалуйста, пользуйся КНОПКАМИ\n\nОни\
 созданы специально для твоего удобства, чтобы тебе не пришлось ничего лишнего вводить. Они появляются когда нужно\
 и исчезают соответственно.\nВ пункте 2 ты сразу выбираешь игру на стол, за который ты садишься. \
 \nПункт 3 существует для того, чтобы не привязывать игру к столу, но менять её статус. Также, если ты будешь менять\
 статус игры, которая находится за столом, то тебе будет предложено освободить стол. Нельзя освободить игру за столом,\
 а стол оставить занятым)\n/mod в меню нужен на всякий случай - чтобы в любой момент можно было обратиться к меню\
 модератора.\nПо элементно каждую функцию объяснять не буду. Предлагаю тебе побаловаться немного туда сюда, если игры\
 ещё не начались, чтобы разобраться во всём.\n\nС любовью, Бэтмен из КТМ🖤"

whoarewe = "КТМ - Клуб Творческой Молодёжи, главный организатор этого мероприятия. Возможно, вы слышали про другие наши\
 мероприятия или про те же настольные игры. Нет? Тогда обязательно загляни в нашу группу, как будет время:\
 \nhttps://vk.com/aktiv_student\nКстати говоря, нам уже семь лет!\
 За это время мы сильно менялись, но никогда не переставали делать то, что нам нравится так, чтобы\
 это нравилось и вам!\n\
\nА наши друзья сегодня:\
\nGEEKMO - официальный клуб настольных игр ИТМО, сообщество людей, влюбленных в настольные и ролевые игры. У них нет\
 места токсичности и агрессии,\
 но это не отменяет присутствие соревновательного духа! Если что, ты можешь всегда к ним заглянуть даже если ты не\
 один из студентов ИТМО. Стало интересно? Вот ссылочка:\nhttps://vk.com/geekmo\n\n\
ГИК - Герценовский Игровой Клуб - студенческое объединение РГПУ им. А. И. Герцена, занимающееся организацией досуга\
 студентов.\nИгровой Клуб проводит мероприятия различных форматов и тематик, на которых каждый студент сможет найти\
 что-то по-настоящему интересное для себя! Они всегда рады гостям как из их университета, так и из других ВУЗов!: \
 \nhttps://vk.com/herzengame\n\
\nHobby Games - это сеть фирменных магазинов, в которых представлен широчайший ассортимент настольных игр.\
  К ним могут всегда прийти как преданные фанаты этого хобби, так и те, кто только начинает с ним знакомиться:\
\nhttps://hobbygames.ru\n\
\nГлавную информацию я тебе рассказал, значит теперь могу с чистой душой продолжить свою работу. Кстати говоря...\
Может быть ты желаешь оставить отзыв о моей работе, да и о настолках в целом?👉👈\n\nОставить отзыв?"